In [4]:
%matplotlib inline
import pandas as pd

In [5]:
titles = pd.read_csv('C:/Users/Manzoo/Learning/Day16/titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

### How many movies are listed in the titles dataframe?

In [6]:
print(len(titles.index)," movies are listed in the dataframe")

244914  movies are listed in the dataframe

### What are the earliest two films listed in the titles dataframe?

In [174]:
titles.sort_values(by='year')['title'].head(2)

193222            Miss Jerry
51388     The Startled Lover
Name: title, dtype: object

### How many movies have the title "Hamlet"?

In [139]:
print(titles[titles['title'].str.contains("Hamlet")].shape[0] , "movie titles contain 'Hamlet'")

57 movie titles contain 'Hamlet'

### How many movies are titled "North by Northwest"?

In [10]:
print (len(titles[titles['title'].str.match("North by Northwest")].index) , "movies are titled 'North by Northwest'")

1 movies are titled 'North by Northwest'

### When was the first movie titled "Hamlet" made?

In [11]:
titles[titles['title']=="Hamlet"].sort_values(by='year').head(1)['year']

52521    1910
Name: year, dtype: int64

### List all of the "Treasure Island" movies from earliest to most recent.

In [12]:
titles[titles['title']=="Treasure Island"].sort_values(by='year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [178]:
print(titles[titles['year']==1950].shape[0] , " movies were made in 1950")

1113  movies were made in 1950

### How many movies were made in the year 1960?

In [177]:
print(titles[titles['year']==1960].shape[0] , " movies were made in 1960")

1549  movies were made in 1960

### How many movies were made from 1950 through 1959?

In [179]:
print(len(titles[(titles['year']>=1950) & (titles['year']<=1959)].index) , " movies were made from 1950 to 1959")

12934  movies were made from 1950 to 1959

### In what years has a movie titled "Batman" been released?

In [79]:
titles[titles['title']=='Batman']['year']

39349     1943
240896    1989
Name: year, dtype: int64

### How many roles were there in the movie "Inception"?

In [30]:
cast = pd.read_csv('C:/Users/Manzoo/Learning/Day16/cast.csv')
print(cast[cast['title']=='Inception']['character'].unique().shape[0]," roles were there in 'Inception' movie")

56  roles were there in 'Inception' movie

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [183]:
print (cast[cast['title']=='Inception']['n'].isnull().sum() , " roles in move Inception are not ranked by n value")

27  roles in move Inception are not ranked by n value

### But how many roles in the movie "Inception" did receive an "n" value?

In [31]:
print (cast[cast['title']=='Inception']['n'].notnull().sum(), " roles in move Inception are not ranked by n value")

51  roles in move Inception are ranked by n value

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [59]:
cast[((cast['title']=='North by Northwest') & (cast['n'].isnull()==False))].sort_values(by='n')['name']

871426               Cary Grant
3518333         Eva Marie Saint
1457165             James Mason
3157232     Jessie Royce Landis
356707           Leo G. Carroll
3048272    Josephine Hutchinson
1695173             Philip Ober
1275337           Martin Landau
2447081           Adam Williams
1811387            Edward Platt
665768        Robert Ellenstein
2295714            Les Tremayne
464736          Philip Coolidge
1508344           Patrick McVey
206471             Edward Binns
1384780               Ken Lynch
Name: name, dtype: object

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [10]:
cast[((cast['title']=='Sleuth')&(cast['year']==1972)) ][['name','type','n']].sort_values(by='n')

                       name     type    n
1705394    Laurence Olivier    actor  1.0
326773        Michael Caine    actor  2.0
373876       Alec Cawthorne    actor  3.0
1465483  John (II) Matthews    actor  4.0
2724553  Eve (III) Channing  actress  5.0
1448690        Teddy Martin    actor  6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [11]:
cast[((cast['title']=='Sleuth')&(cast['year']==2007)) ][['name','type','n']].sort_values(by='n')

                        name     type    n
326774         Michael Caine    actor  1.0
1293634             Jude Law    actor  2.0
1805907        Harold Pinter    actor  3.0
260242       Kenneth Branagh    actor  NaN
373877   Alec (II) Cawthorne    actor  NaN
2724552    Eve (II) Channing  actress  NaN
3370424    Carmel O'Sullivan  actress  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [14]:
print(cast[((cast['title'] == 'Hamlet') & (cast['year']==1921))].shape[0]," roles were credited in the silent 1921 version of Hamlet")
##len(cast[((cast['title'] == 'Hamlet') & (cast['year']==1921))].index)

9  roles were credited in the silent 1921 version of Hamlet

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [16]:
print(cast[((cast['title'] == 'Hamlet') & (cast['year']==1996) & (cast['n'].isnull()==False))].shape[0]," roles were credited in Branagh 1996 Hamlet")

46  roles were credited in Branagh 1996 Hamlet

### How many "Hamlet" roles have been listed in all film credits through history?

In [18]:

print(cast[cast['character']=='Hamlet'].shape[0] , "Hamlet roles have been listed in all film credits through history")

96 Hamlet roles have been listed in all film credits through history

### How many people have played an "Ophelia"?

In [20]:
print(cast[cast['character']=='Ophelia']['name'].unique().shape[0]," people have played an Ophelia")

115  people have played an Ophelia

### How many people have played a role called "The Dude"?

In [21]:
print(cast[cast['character']=='The Dude']['name'].unique().shape[0] , " people have played 'The Dude'")

19  people have played 'The Dude'

### How many people have played a role called "The Stranger"?

In [22]:
print(cast[cast['character']=='The Stranger']['name'].unique().shape[0] , " people have played a role called 'The Stranger'")

202  people have played a role called 'The Stranger'

### How many roles has Sidney Poitier played throughout his career?

In [23]:
print("Sidney Poitier has played ",cast[cast['name']=='Sidney Poitier']['character'].unique().shape[0]," roles throughout his career")

Sidney Poitier has played  41  roles throughout his career

### How many roles has Judi Dench played?

In [24]:
print("Judi Dench has played ",cast[cast['name']=='Judi Dench']['character'].unique().shape[0]," roles throughout his career")

Judi Dench has played  46  roles throughout his career

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [134]:
cast[(cast['name']=='Cary Grant') & (cast['n']==2) & (cast['year']>=1940)  & (cast['year']<=1949)][['character','year']]  ##.sort_by('year')

          character  year
871423   Nick Arden  1940
871433  Roger Adams  1941

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [146]:
cast[(cast['name']=='Cary Grant')&(cast['year']>=1940) & (cast['year']<=1949) & (cast['n']==1)][['character','year']].sort_values(by='year')

                                   character  year
871448                           Matt Howard  1940
871407                          Walter Burns  1940
871450                    C. K. Dexter Haven  1940
871438                      Johnnie Aysgarth  1941
871452                          Leopold Dilg  1942
871429                 Patrick 'Pat' O'Toole  1942
871398                         Capt. Cassidy  1943
871422  Joe Adams -posing as Joe Bascopolous  1943
871430                           Jerry Flynn  1944
871390                     Mortimer Brewster  1944
871425                            Ernie Mott  1944
871424                           Cole Porter  1946
871427                                Devlin  1946
871444                           Dick Nugent  1947
871445                                Dudley  1947
871421                         Jim Blandings  1948
871402                     Dr. Madison Brown  1948
871411                 Captain Henri Rochard  1949

### How many roles were available for actors in the 1950s?

In [162]:
cast[(cast['year']>=1950) & (cast['year']<=1959) & (cast['type']=='actor')]['character'].shape[0]
##cast[cast['type']=='actor']

157738

### How many roles were available for actresses in the 1950s?

In [163]:
cast[(cast['year']>=1950) & (cast['year']<=1959) & (cast['type']=='actress')]['character'].shape[0]

57733

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [165]:
cast[(cast['year']<=1980) & (cast['n']==1)]['character'].shape[0]

65140

### How many non-leading roles were available through from the beginning of film history through 1980?

In [166]:
cast[(cast['year']<=1980) & (cast['n']!=1)]['character'].shape[0]

1117667

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [168]:
cast[(cast['year']<=1980) & (cast['n'].isnull()==True)]['character'].shape[0]

448347

In [169]:
release.head()

                    title  year      country        date
0   #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                   #BKKY  2016     Cambodia  2017-10-12
2                 #Beings  2015      Romania  2015-01-29
3               #Captured  2017          USA  2017-09-05
4  #Ewankosau saranghaeyo  2015  Philippines  2015-01-21